Обработки/Reports/_РасшифровкаНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаНалогаНаИмущество</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаНалогаНаИмущество/Ext/ObjectModule.bsl
&НаСервере
Процедура ПолучитьИмуществоИДатыПоступленияВыбытия(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
	
	НачалоУчетаПоСчетуДУ = СчетДоверительногоУправления.ДатаЗаключения;
	КонецТекущегоКвартала = КонецКвартала(Период);
	
	#Область ЗапросПоОбъектамНедвижимости
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА 1
		|		КОГДА УсловияСделокСНедвижимостьюСрезПоследних.Основание ССЫЛКА Документ.ЗаявкаПайщика
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК Движение,
		|	ВЫБОР
		|		КОГДА РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости
		|			ТОГДА УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности.Дата
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи.Дата, УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности.Дата)
		|	КОНЕЦ КАК Дата
		|ПОМЕСТИТЬ _ДвиженияОС
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ОбъектНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО (РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|	И (УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности <> ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)
		|			ИЛИ УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи <> ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДвиженияОС.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД) > &НачалоУчетаПоСчетуДУ
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&КонецПериода, ГОД), СЕКУНДА, -1)
		|		ИНАЧЕ &НачалоУчетаПоСчетуДУ
		|	КОНЕЦ КАК НачалоПериода,
		|	СУММА(ВЫБОР
		|			КОГДА _ДвиженияОС.Дата < НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|				ТОГДА _ДвиженияОС.Движение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокНачалоГода,
		|	СУММА(ВЫБОР
		|			КОГДА _ДвиженияОС.Дата < &КонецПериода
		|				ТОГДА _ДвиженияОС.Движение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокКонецПериода,
		|	&КонецПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _ОстаткиОбъектовНедвижимости
		|ИЗ
		|	_ДвиженияОС КАК _ДвиженияОС
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДвиженияОС.ОбъектНедвижимости
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|				КОГДА _ДвиженияОС.Дата < НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|					ТОГДА _ДвиженияОС.Движение
		|				ИНАЧЕ 0
		|			КОНЕЦ) <> 0
		|		ИЛИ СУММА(ВЫБОР
		|				КОГДА _ДвиженияОС.Дата < &КонецПериода
		|					ТОГДА _ДвиженияОС.Движение
		|				ИНАЧЕ 0
		|			КОНЕЦ) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости.Представление КАК ОбъектНедвижимостиПредставление
		|ПОМЕСТИТЬ _ОстаткиОбъектовОтрицательные
		|ИЗ
		|	_ОстаткиОбъектовНедвижимости КАК _ОстаткиОбъектовНедвижимости
		|ГДЕ
		|	_ОстаткиОбъектовНедвижимости.ОстатокКонецПериода < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ОстаткиОбъектовНедвижимости.НачалоПериода КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА _ОстаткиОбъектовНедвижимости.ОстатокКонецПериода = 1
		|			ТОГДА _ОстаткиОбъектовНедвижимости.ОстатокКонецПериода
		|		ИНАЧЕ _ОстаткиОбъектовНедвижимости.ОстатокНачалоГода
		|	КОНЕЦ КАК Остаток,
		|	_ОстаткиОбъектовНедвижимости.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПереходаПрава,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыбытия
		|ПОМЕСТИТЬ _ОстаткиНедвижимостиДляРасчета
		|ИЗ
		|	_ОстаткиОбъектовНедвижимости КАК _ОстаткиОбъектовНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДвиженияОС.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ДвиженияОС.Дата КАК Дата,
		|	_ДвиженияОС.Движение КАК НаправлениеДвижения,
		|	_ДвиженияОС.ОбъектНедвижимости.Представление КАК ОбъектНедвижимостиПредставление
		|ПОМЕСТИТЬ _ДвиженияОбъектовНедвижимости
		|ИЗ
		|	_ДвиженияОС КАК _ДвиженияОС
		|ГДЕ
		|	_ДвиженияОС.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериода, ГОД) И &КонецПериода";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("КонецПериода", КонецТекущегоКвартала);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоУчетаПоСчетуДУ", НачалоУчетаПоСчетуДУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ОстаткиОбъектовОтрицательные").Выбрать(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По объекту недвижимости " 
			+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " обнаружен отрицательный остаток! ",,,,Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРасчетаНалога = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ОстаткиНедвижимостиДляРасчета").Выгрузить();
	
	ВыборкаДетальныеЗаписи = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ДвиженияОбъектовНедвижимости",,,,"ОбъектНедвижимости, Дата").Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокиОбъекта = ТаблицаРасчетаНалога.НайтиСтроки(новый Структура("ОбъектНедвижимости", ВыборкаДетальныеЗаписи.ОбъектНедвижимости));
		КоличествоСтрок = СтрокиОбъекта.Количество();
		Если КоличествоСтрок > 0 И ВыборкаДетальныеЗаписи.НаправлениеДвижения = -1 Тогда
			Строка = СтрокиОбъекта[КоличествоСтрок - 1];
			Если Строка.ОкончаниеПериода < КонецТекущегоКвартала Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект недвижимости " 
					+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " не числится в собственности на дату " 
					+ ВыборкаДетальныеЗаписи.Дата + "! ",,,,Отказ);
			Иначе
				Строка.ДатаВыбытия = ВыборкаДетальныеЗаписи.Дата;
				Строка.ОкончаниеПериода = ВыборкаДетальныеЗаписи.Дата;
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.НаправлениеДвижения = 1 Тогда
			
			Если КоличествоСтрок > 0 Тогда
				Строка = СтрокиОбъекта[КоличествоСтрок - 1];
				Строка.НачалоПериода = ?(ВыборкаДетальныеЗаписи.Дата < НачалоУчетаПоСчетуДУ, НачалоУчетаПоСчетуДУ, ВыборкаДетальныеЗаписи.Дата); 
				Строка.ДатаПереходаПрава = ВыборкаДетальныеЗаписи.Дата;    
				//Работает для кадастровой стоимости. Кая будет для среднегодовой - пока не ясно. 
			КонецЕсли;
			
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект недвижимости " 
				+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление + " совсем не числится в собственности на дату " 
				+ ВыборкаДетальныеЗаписи.Дата + "! ",,,,Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаРасчетаНалога, "_ИмуществоИДатыПоступленияВыбытия", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьТаблицуЛьготПоОбъектамНедвижимости() 
	// хардкод для обного объекта 
	
	ТаблицаЛьготы = Новый ТаблицаЗначений;
	ТаблицаЛьготы.Колонки.Добавить("ОбъектНедвижимости",	 Новый ОписаниеТипов("СправочникСсылка.ОбъектыНедвижимости")); 
	ТаблицаЛьготы.Колонки.Добавить("Льгота", 				 Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5,2,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЛьготы.Колонки.Добавить("НачалоПериодаЛьготы", 	 Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаЛьготы.Колонки.Добавить("ОкончаниеПериодаЛьготы", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	НоваяСтрока = ТаблицаЛьготы.Добавить();
	НоваяСтрока.ОбъектНедвижимости = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОбъектНедвижимостиМоскваБахрушина13кв19");
	НоваяСтрока.Льгота = 100;
	НоваяСтрока.НачалоПериодаЛьготы = Дата(2024, 8, 7);
	НоваяСтрока.ОкончаниеПериодаЛьготы = Дата(2025, 12, 31);
	
	Возврат ТаблицаЛьготы;  	
	
КонецФункции

&НаСервере
Процедура ПолучитьАвансовыеПлатежиИРеквизитыОбъектов(Период, Организация, СчетДоверительногоУправления, Запрос)
	
	//_РеквизитыОбъектовНедвижимости ? вызывает ыопросы. СрезПервых и СрезПослених на одну дату? 
	ТаблицаЛьготы =  ПолучитьТаблицуЛьготПоОбъектамНедвижимости();  
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаЛьготы, "_ТаблицаЛьготы", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияНалоговОбороты.СубъектАналитики КАК ОбъектНедвижимости,
		|	НачисленияНалоговОбороты.СуммаОборот КАК СуммаОборот,
		|	НачисленияНалоговОбороты.Основание КАК Основание,
		|	НачислениеЗадолженности.ОкончаниеПериодаНачисления КАК ОкончаниеПериодаНачисления,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.РасчетНалогаПоКадастровойСтоимости КАК РасчетНалогаПоКадастровойСтоимости
		|ПОМЕСТИТЬ _АвансовыеПлатежи
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов.Обороты(
		|			&НачалоГода,
		|			&ДоНачисления,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаИмущество)) КАК НачисленияНалоговОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО НачисленияНалоговОбороты.Основание = НачислениеЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО НачисленияНалоговОбороты.СубъектАналитики = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	КВАРТАЛ(&КонецПериода) = 4
		|	И ГОД(НачислениеЗадолженности.НачалоПериодаНачисления) = ГОД(&КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СписокОбъектов.ОбъектНедвижимости КАК ОбъектНедвижимости
		|ПОМЕСТИТЬ _ОбъектыНедвижимостиВсе
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости
		|	ИЗ
		|		_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_АвансовыеПлатежи.ОбъектНедвижимости
		|	ИЗ
		|		_АвансовыеПлатежи КАК _АвансовыеПлатежи) КАК СписокОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.РасчетНалогаПоКадастровойСтоимости, РеквизитыОбъектовНедвижимостиСрезПервых.РасчетНалогаПоКадастровойСтоимости) КАК РасчетПоКадастровойСтоимости,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.СтавкаНалогаНаИмущество, РеквизитыОбъектовНедвижимостиСрезПервых.СтавкаНалогаНаИмущество) КАК СтавкаНалога,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.КадастроваяСтоимость, РеквизитыОбъектовНедвижимостиСрезПервых.КадастроваяСтоимость) КАК КадастроваяСтоимость,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.КодОКТМО, РеквизитыОбъектовНедвижимостиСрезПервых.КодОКТМО) КАК КодОКТМО,
		|	ЕСТЬNULL(_ТаблицаЛьготы.Льгота, 0) КАК Льгота,
		|	ЕСТЬNULL(_ТаблицаЛьготы.НачалоПериодаЛьготы, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоПериодаЛьготы,
		|	ЕСТЬNULL(_ТаблицаЛьготы.ОкончаниеПериодаЛьготы, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеПериодаЛьготы
		|ПОМЕСТИТЬ _РеквизитыОбъектовНедвижимости
		|ИЗ
		|	_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПервых(
		|				&НачалоГода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							_ОбъектыНедвижимостиВсе.ОбъектНедвижимости
		|						ИЗ
		|							_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимостиВсе)) КАК РеквизитыОбъектовНедвижимостиСрезПервых
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезПервых.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&НачалоГода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							_ОбъектыНедвижимостиВсе.ОбъектНедвижимости
		|						ИЗ
		|							_ОбъектыНедвижимостиВсе КАК _ОбъектыНедвижимостиВсе)) КАК РеквизитыОбъектовНедвижимостиСрезНаНачалоГода
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезНаНачалоГода.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЛьготы КАК _ТаблицаЛьготы
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = _ТаблицаЛьготы.ОбъектНедвижимости";
	
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Период));
	Запрос.УстановитьПараметр("ДоНачисления", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНалогНаИмуществоПоКадастровойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
		
	#Область ЗапросРасчетпоКадастровой
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	ВЫБОР
		|		КОГДА ГОД(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) = ГОД(&КонецПериода)
		|			ТОГДА МЕСЯЦ(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) + ВЫБОР
		|					КОГДА ДЕНЬ(_ИмуществоИДатыПоступленияВыбытия.НачалоПериода) > 15
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК МесяцНачалаДляКадастровой,
		|	МЕСЯЦ(_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода) + ВЫБОР
		|		КОГДА ДЕНЬ(_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода) < 15
		|			ТОГДА -1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МесяцОкончанияДляКадастровой,
		|	ВЫБОР
		|		КОГДА &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|			ТОГДА 1
		|		ИНАЧЕ 3 * КВАРТАЛ(&КонецПериода) - 2
		|	КОНЕЦ КАК МесяцНачалаПериодаПоКадастру,
		|	_РеквизитыОбъектовНедвижимости.СтавкаНалога КАК СтавкаНалога,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаПереходаПрава КАК ДатаПереходаПрава,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаВыбытия КАК ДатаВыбытия,
		|	_РеквизитыОбъектовНедвижимости.Льгота КАК Льгота,
		|	_РеквизитыОбъектовНедвижимости.НачалоПериодаЛьготы КАК НачалоПериодаЛьготы,
		|	_РеквизитыОбъектовНедвижимости.ОкончаниеПериодаЛьготы КАК ОкончаниеПериодаЛьготы
		|ПОМЕСТИТЬ _ПериодыРасчетаПоКадастру
		|ИЗ
		|	_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетаПоКадастру.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ПериодыРасчетаПоКадастру.СтавкаНалога КАК СтавкаНалога,
		|	_ПериодыРасчетаПоКадастру.КодОКТМО КАК КодОКТМО,
		|	(ВЫБОР
		|		КОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой < МЕСЯЦ(&КонецПериода)
		|			ТОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой
		|		ИНАЧЕ МЕСЯЦ(&КонецПериода)
		|	КОНЕЦ - ВЫБОР
		|		КОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру < _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|			ТОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|		ИНАЧЕ _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру
		|	КОНЕЦ + 1) / (МЕСЯЦ(&КонецПериода) - _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру + 1) КАК КоэффициентВладения,
		|	_ПериодыРасчетаПоКадастру.КадастроваяСтоимость КАК БазаНалога,
		|	ВЫРАЗИТЬ((100 - _ПериодыРасчетаПоКадастру.Льгота) / 100 * _ПериодыРасчетаПоКадастру.КадастроваяСтоимость * _ПериодыРасчетаПоКадастру.СтавкаНалога / 100 * ВЫБОР
		|			КОГДА &КонецПериода <> КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|				ТОГДА 1 / 4
		|			ИНАЧЕ 1
		|		КОНЕЦ * (ВЫБОР
		|			КОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой < МЕСЯЦ(&КонецПериода)
		|				ТОГДА _ПериодыРасчетаПоКадастру.МесяцОкончанияДляКадастровой
		|			ИНАЧЕ МЕСЯЦ(&КонецПериода)
		|		КОНЕЦ - ВЫБОР
		|			КОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру < _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|				ТОГДА _ПериодыРасчетаПоКадастру.МесяцНачалаДляКадастровой
		|			ИНАЧЕ _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру
		|		КОНЕЦ + 1) / (МЕСЯЦ(&КонецПериода) - _ПериодыРасчетаПоКадастру.МесяцНачалаПериодаПоКадастру + 1) КАК ЧИСЛО(15, 0)) КАК СуммаНалога,
		|	ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0) КАК СуммаАванса
		|ПОМЕСТИТЬ _РасчетНалогаПоКадастровойСтоимости
		|ИЗ
		|	_ПериодыРасчетаПоКадастру КАК _ПериодыРасчетаПоКадастру
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_АвансовыеПлатежи.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ГДЕ
		|			_АвансовыеПлатежи.РасчетНалогаПоКадастровойСтоимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_АвансовыеПлатежи.ОбъектНедвижимости) КАК _АвансовыеПлатежи
		|		ПО _ПериодыРасчетаПоКадастру.ОбъектНедвижимости = _АвансовыеПлатежи.ОбъектНедвижимости
		|ГДЕ
		|	_ПериодыРасчетаПоКадастру.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫРАЗИТЬ(_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости КАК Справочник.ОбъектыНедвижимости).Представление КАК ОбъектНедвижимостиПредставление,
		|	_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога = 0 КАК НеУказанаСтавкаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.БазаНалога = 0 КАК НеУказанаКадастроваяСтоимость
		|ИЗ
		|	_РасчетНалогаПоКадастровойСтоимости КАК _РасчетНалогаПоКадастровойСтоимости
		|ГДЕ
		|	(_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога = 0
		|			ИЛИ _РасчетНалогаПоКадастровойСтоимости.БазаНалога = 0)";
	
	#КонецОбласти	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеУказанаКадастроваяСтоимость Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана кадастровая стоимость!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
		Если Выборка.НеУказанаСтавкаНалога Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана ставка налога!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНалогНаИмуществоПоСреднегодовойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ)
	
	ТаблицаДатДляСреднегодовой = Новый ТаблицаЗначений();
	ТаблицаДатДляСреднегодовой.Колонки.Добавить("НомерМесяца", Новый ОписаниеТипов("Число"));
	ТаблицаДатДляСреднегодовой.Колонки.Добавить("ДатаОценки", Новый ОписаниеТипов("Дата"));
	
	СтрокаДаты = ТаблицаДатДляСреднегодовой.Добавить();
	СтрокаДаты.НомерМесяца = 0;
	СтрокаДаты.ДатаОценки = КонецДня(Дата(Год(Период) - 1, 12, 31));
	
	Для НомерМесяца = 1 по 12 Цикл
		СтрокаДаты = ТаблицаДатДляСреднегодовой.Добавить();
		СтрокаДаты.НомерМесяца = НомерМесяца;
		СтрокаДаты.ДатаОценки = КонецМесяца(Дата(Год(Период), НомерМесяца, 1));
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаДатДляСреднегодовой, "_ТаблицаДатДляСреднегодовой", Запрос.МенеджерВременныхТаблиц);
	
	#Область ЗапросРасчетПоСреднегодовой
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	_РеквизитыОбъектовНедвижимости.СтавкаНалога КАК СтавкаНалога,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_ИмуществоИДатыПоступленияВыбытия.НачалоПериода КАК НачалоПериода,
		|	_ИмуществоИДатыПоступленияВыбытия.ОкончаниеПериода КАК ОкончаниеПериода,
		|	_ИмуществоИДатыПоступленияВыбытия.ДатаВыбытия КАК ДатаВыбытия
		|ПОМЕСТИТЬ _ПериодыРасчетапоСреднегодовой
		|ИЗ
		|	_ИмуществоИДатыПоступленияВыбытия КАК _ИмуществоИДатыПоступленияВыбытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _ИмуществоИДатыПоступленияВыбытия.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|ГДЕ
		|	НЕ _РеквизитыОбъектовНедвижимости.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ДатыДляРасчетаСреднегодовой
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДатДляСреднегодовой КАК _ТаблицаДатДляСреднегодовой
		|		ПО _ПериодыРасчетапоСреднегодовой.НачалоПериода <= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|			И _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода >= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|ГДЕ
		|	НЕ _ПериодыРасчетапоСреднегодовой.РасчетПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ДатыДляРасчетаСреднегодовой.ДатаОценки КАК ДатаОценки,
		|	МАКСИМУМ(ОценкиСтоимостиПрочихАктивов.Период) КАК Период
		|ПОМЕСТИТЬ _ДатыОценочныхСтоимостей
		|ИЗ
		|	_ДатыДляРасчетаСреднегодовой КАК _ДатыДляРасчетаСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов КАК ОценкиСтоимостиПрочихАктивов
		|		ПО _ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивов.СубъектАналитики
		|			И (ОценкиСтоимостиПрочихАктивов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость))
		|			И _ДатыДляРасчетаСреднегодовой.ДатаОценки >= ОценкиСтоимостиПрочихАктивов.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыДляРасчетаСреднегодовой.ОбъектНедвижимости,
		|	_ДатыДляРасчетаСреднегодовой.ДатаОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА _ПериодыРасчетапоСреднегодовой.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И _ПериодыРасчетапоСреднегодовой.ДатаВыбытия < _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода
		|					И _ПериодыРасчетапоСреднегодовой.ДатаВыбытия < _ТаблицаДатДляСреднегодовой.ДатаОценки
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ОценкиСтоимостиПрочихАктивов.Стоимость, 0)
		|		КОНЕЦ) КАК Стоимость,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ОценочныеСтоимостиДляРасчета
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДатДляСреднегодовой КАК _ТаблицаДатДляСреднегодовой
		|		ПО _ПериодыРасчетапоСреднегодовой.ОкончаниеПериода >= _ТаблицаДатДляСреднегодовой.ДатаОценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыОценочныхСтоимостей КАК _ДатыОценочныхСтоимостей
		|		ПО (_ТаблицаДатДляСреднегодовой.ДатаОценки = _ДатыОценочныхСтоимостей.ДатаОценки)
		|			И _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _ДатыОценочныхСтоимостей.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов КАК ОценкиСтоимостиПрочихАктивов
		|		ПО (_ДатыОценочныхСтоимостей.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивов.СубъектАналитики)
		|			И (_ДатыОценочныхСтоимостей.Период = ОценкиСтоимостиПрочихАктивов.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости,
		|	_ТаблицаДатДляСреднегодовой.ДатаОценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости, _АвансовыеПлатежи.ОбъектНедвижимости) КАК ОбъектНедвижимости,
		|	_ПериодыРасчетапоСреднегодовой.КодОКТМО КАК КодОКТМО,
		|	_ПериодыРасчетапоСреднегодовой.СтавкаНалога КАК СтавкаНалога,
		|	ЕСТЬNULL(_ОценочныеСтоимостиДляРасчета.Стоимость, 0) КАК Стоимость,
		|	_ОценочныеСтоимостиДляРасчета.ДатаОценки КАК ДатаОценки,
		|	ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0) КАК СуммаАванса
		|ПОМЕСТИТЬ _РасчетНалогаПоСреднегодовойСтоимости
		|ИЗ
		|	_ПериодыРасчетапоСреднегодовой КАК _ПериодыРасчетапоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОценочныеСтоимостиДляРасчета КАК _ОценочныеСтоимостиДляРасчета
		|		ПО _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _ОценочныеСтоимостиДляРасчета.ОбъектНедвижимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_АвансовыеПлатежи.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ГДЕ
		|			НЕ _АвансовыеПлатежи.РасчетНалогаПоКадастровойСтоимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_АвансовыеПлатежи.ОбъектНедвижимости) КАК _АвансовыеПлатежи
		|		ПО _ПериодыРасчетапоСреднегодовой.ОбъектНедвижимости = _АвансовыеПлатежи.ОбъектНедвижимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ВЫРАЗИТЬ(_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК Справочник.ОбъектыНедвижимости).Представление КАК ОбъектНедвижимостиПредставление,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога = 0 КАК НеУказанаСтавкаНалога,
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = """" КАК НеУказанКодОКТМО
		|ИЗ
		|	_РасчетНалогаПоСреднегодовойСтоимости КАК _РасчетНалогаПоСреднегодовойСтоимости
		|ГДЕ
		|	(_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = """"
		|			ИЛИ _РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога = 0)";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеУказанКодОКТМО Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указан код ОКТМО!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
		Если Выборка.НеУказанаСтавкаНалога Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта недвижимости " + Выборка.ОбъектНедвижимостиПредставление 
				+ " не указана ставка налога!", Выборка.ОбъектНедвижимости,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьНалогНаИмущество(Период, Организация, СчетДоверительногоУправления, Отказ, Расшифровка) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	ПолучитьИмуществоИДатыПоступленияВыбытия(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ПолучитьАвансовыеПлатежиИРеквизитыОбъектов(Период, Организация, СчетДоверительногоУправления, Запрос);
	
	РассчитатьНалогНаИмуществоПоКадастровойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	РассчитатьНалогНаИмуществоПоСреднегодовойСтоимости(Период, Организация, СчетДоверительногоУправления, Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	#Область ЗапросСвернутьДанныеПоСреднегодовойДляДекларации
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО КАК КодОКТМО,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(_РасчетНалогаПоСреднегодовойСтоимости.Стоимость) КАК СтоимостьПоЛистуДекларации,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ДатаОценки КАК ДатаОценки,
		|	СУММА(ЕСТЬNULL(_АвансовыеПлатежи.СуммаОборот, 0)) КАК СуммаАванса,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|ПОМЕСТИТЬ _РасчетСтоимостиНаДаты
		|ИЗ
		|	_РасчетНалогаПоСреднегодовойСтоимости КАК _РасчетНалогаПоСреднегодовойСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|			СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|				ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|				ПО _АвансовыеПлатежи.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_РеквизитыОбъектовНедвижимости.КодОКТМО) КАК _АвансовыеПлатежи
		|		ПО _РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО = _АвансовыеПлатежи.КодОКТМО
		|
		|СГРУППИРОВАТЬ ПО
		|	_РасчетНалогаПоСреднегодовойСтоимости.ОбъектНедвижимости,
		|	_РасчетНалогаПоСреднегодовойСтоимости.КодОКТМО,
		|	_РасчетНалогаПоСреднегодовойСтоимости.ДатаОценки,
		|	_РасчетНалогаПоСреднегодовойСтоимости.СтавкаНалога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО КАК КодОКТМО,
		|	_РеквизитыОбъектовНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(_АвансовыеПлатежи.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ _АвансовыеПлатежиСвернутые
		|ИЗ
		|	_АвансовыеПлатежи КАК _АвансовыеПлатежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыОбъектовНедвижимости КАК _РеквизитыОбъектовНедвижимости
		|		ПО _АвансовыеПлатежи.ОбъектНедвижимости = _РеквизитыОбъектовНедвижимости.ОбъектНедвижимости
		|
		|СГРУППИРОВАТЬ ПО
		|	_РеквизитыОбъектовНедвижимости.ОбъектНедвижимости,
		|	_РеквизитыОбъектовНедвижимости.КодОКТМО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетНалогаПоСреднегодовой.КодОКТМО КАК КодОКТМО,
		|	_РасчетНалогаПоСреднегодовой.СтавкаНалога КАК СтавкаНалога,
		|	_РасчетНалогаПоСреднегодовой.БазаНалога КАК БазаНалога,
		|	_РасчетНалогаПоСреднегодовой.СуммаНалога КАК СуммаНалога,
		|	ЕСТЬNULL(_АвансовыеПлатежиСвернутые.СуммаОборот, 0) КАК СуммаАванса,
		|	_РасчетНалогаПоСреднегодовой.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ЛОЖЬ КАК РасчетПоКадастровойСтоимости
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РасчетСтоимостиНаДаты.КодОКТМО КАК КодОКТМО,
		|		_РасчетСтоимостиНаДаты.СтавкаНалога КАК СтавкаНалога,
		|		ВЫРАЗИТЬ(СУММА(_РасчетСтоимостиНаДаты.СтоимостьПоЛистуДекларации) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РасчетСтоимостиНаДаты.ДатаОценки) КАК ЧИСЛО(15, 2)) КАК БазаНалога,
		|		ВЫРАЗИТЬ((ВЫРАЗИТЬ(СУММА(_РасчетСтоимостиНаДаты.СтоимостьПоЛистуДекларации) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _РасчетСтоимостиНаДаты.ДатаОценки) КАК ЧИСЛО(15, 2))) * _РасчетСтоимостиНаДаты.СтавкаНалога / 100 * ВЫБОР
		|				КОГДА &КонецПериода <> КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
		|					ТОГДА 1 / 4
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНалога,
		|		_РасчетСтоимостиНаДаты.ОбъектНедвижимости КАК ОбъектНедвижимости
		|	ИЗ
		|		_РасчетСтоимостиНаДаты КАК _РасчетСтоимостиНаДаты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_РасчетСтоимостиНаДаты.ОбъектНедвижимости,
		|		_РасчетСтоимостиНаДаты.КодОКТМО,
		|		_РасчетСтоимостиНаДаты.СтавкаНалога) КАК _РасчетНалогаПоСреднегодовой
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АвансовыеПлатежиСвернутые КАК _АвансовыеПлатежиСвернутые
		|		ПО _РасчетНалогаПоСреднегодовой.ОбъектНедвижимости = _АвансовыеПлатежиСвернутые.ОбъектНедвижимости
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РасчетНалогаПоКадастровойСтоимости.КодОКТМО,
		|	_РасчетНалогаПоКадастровойСтоимости.СтавкаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.БазаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.СуммаНалога,
		|	_РасчетНалогаПоКадастровойСтоимости.СуммаАванса,
		|	_РасчетНалогаПоКадастровойСтоимости.ОбъектНедвижимости,
		|	ИСТИНА
		|ИЗ
		|	_РасчетНалогаПоКадастровойСтоимости КАК _РасчетНалогаПоКадастровойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОценочныеСтоимостиДляРасчета.ДатаОценки КАК ДатаОценки
		|ПОМЕСТИТЬ _ДатыОценкиИмущества
		|ИЗ
		|	_ОценочныеСтоимостиДляРасчета КАК _ОценочныеСтоимостиДляРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.КодОКТМО КАК КодОКТМО,
		|	_Данные.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(_Данные.БазаНалога) КАК БазаНалога,
		|	ВЫРАЗИТЬ(СУММА(_Данные.СуммаНалога) КАК ЧИСЛО(15, 0)) КАК СуммаНалога,
		|	СУММА(_Данные.СуммаАванса) КАК СуммаАванса,
		|	_Данные.РасчетПоКадастровойСтоимости КАК РасчетПоКадастровойСтоимости,
		|	МИНИМУМ(_Данные.ОбъектНедвижимости) КАК ОбъектНедвижимости
		|ИЗ
		|	_Данные КАК _Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	_Данные.КодОКТМО,
		|	_Данные.СтавкаНалога,
		|	_Данные.РасчетПоКадастровойСтоимости";
	
	
	#КонецОбласти
	
	Если Расшифровка Тогда 
		РезультатЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура; 
		
		Результат.Вставить("ТаблицаДанные", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Данные").ПолучитьДанные().Выгрузить());
		Результат.Вставить("ТаблицаСтоимостей", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ОценочныеСтоимостиДляРасчета").ПолучитьДанные().Выгрузить());
		Результат.Вставить("СписокДатОценки", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДатыОценкиИмущества").ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("ДатаОценки"));
		Результат.Вставить("ПериодыРасчетаПоКадастру", Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПериодыРасчетаПоКадастру").ПолучитьДанные().Выгрузить());
		
		Возврат Результат;
		
	Иначе 
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
		
КонецФункции
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, "Расшифровка налога на имущество", "0.04", "", Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьПараметрыШапки(Период, Организация, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	РеквизитыПИФ.КраткоеНаименованиеФонда КАК УчредительУправления,
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК ДоверительныйУправляющийПолноеНаименование,
		|	РеквизитыПИФ.ПолноеНаименованиеФонда КАК УчредительУправленияПолноеНаименование
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних КАК РеквизитыПИФ
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыПИФ.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ЮрФизЛицо", Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция РасчетНалогаПоКадастру(НомерКвартала, СтрокаПериоды)

	Если НомерКвартала = 4 Тогда
		Знаменатель = 12; 
		Числитель = 12 - СтрокаПериоды.МесяцНачалаДляКадастровой + 1 - (12 - СтрокаПериоды.МесяцОкончанияДляКадастровой);
		ЧастьГода = 1;
	Иначе
		Знаменатель = 3;
		Числитель = 0;
		ЧастьГода = 0.25;
		Для Месяц = СтрокаПериоды.МесяцНачалаДляКадастровой По СтрокаПериоды.МесяцОкончанияДляКадастровой Цикл
			Если Месяц >= НомерКвартала * 3 - 2 И Месяц <= НомерКвартала * 3 Тогда
				Числитель = Числитель + 1;
			КонецЕсли;
		КонецЦикла;
		//Если СтрокаПериоды.МесяцНачалаДляКадастровой > НомерКвартала*3 Тогда
		//	Числитель = 0;
		//ИначеЕсли СтрокаПериоды.МесяцНачалаДляКадастровой > (НомерКвартала - 1) * 3 Тогда
		//	Числитель =  НомерКвартала*3 - СтрокаПериоды.МесяцНачалаДляКадастровой + 1
		//Иначе
		//	Числитель = 3;   
		//КонецЕсли;
	КонецЕсли;   
	Льгота = (100 - СтрокаПериоды.Льгота)/100;
	
	Коэффициент = Числитель/Знаменатель * ЧастьГода * Льгота;
	
	Возврат Окр(СтрокаПериоды.КадастроваяСтоимость * СтрокаПериоды.СтавкаНалога /100 * Коэффициент, 0);
	
КонецФункции

Процедура ПечатьРасшифровкиСреднегодоваяСтоимость(ДокументРезультат, Макет, ОбъектыСреднегодоваяСтоимость, СписокДатОценки, ТаблицаСтоимостей)
	
	Область = Макет.ПолучитьОбласть("Раздел");
	Область.Параметры.Раздел = "Расшифровка расчета налога по объектам, облагаемым налогом по среднегодовой стоимости.";
	ДокументРезультат.Вывести(Область);
	
	//печать шапки    
	ТаблицаИтогов = Новый ТаблицаЗначений;
	ТаблицаИтогов.Колонки.Добавить("ОбъектНедвижимости");
	ТаблицаИтогов.Колонки.Добавить("СтавкаНалога");
	СтрокаСвертки = "";
	
	МесяцДаты = 0;
	Область = Макет.ПолучитьОбласть("Шапка|Объект"); 
	ДокументРезультат.Вывести(Область); 
	Для Каждого Элемент из СписокДатОценки Цикл     
		Область = Макет.ПолучитьОбласть("Шапка|Показатель");  
		
		ЗначениеДляОтчета = Элемент + 1;  
		МесяцДаты = Месяц(Элемент);          
		Если МесяцДаты = 12 И Год(Элемент) < Год(ЭтотОбъект.Период.ДатаОкончания) Тогда
			МесяцДаты = 0;
		КонецЕсли;				
		
		Заголовок = "Остаточная стоимость основных средств на " + Формат(ЗначениеДляОтчета, "ДФ=dd.MM.yyyy"); 		
		Область.Параметры.Заголовок = Заголовок;	
		ДокументРезультат.Присоединить(Область);  
		
		ТаблицаИтогов.Колонки.Добавить("Месяц" + МесяцДаты);   
		СтрокаСвертки = СтрокаСвертки + "Месяц" + МесяцДаты + ",";	
		
		Если МесяцДаты = 3 ИЛИ МесяцДаты = 6 ИЛИ МесяцДаты = 9 Тогда  
			
			Квартал = СокрЛП((МесяцДаты/3));   
			Заголовок = "Среднегодовая стоимость недвижимого имущества за " + Квартал + " кв."; 
			Область.Параметры.Заголовок = Заголовок;
			ДокументРезультат.Присоединить(Область);    
			
			Заголовок = "Авансовый платеж за " + Квартал + " кв."; 
			Область.Параметры.Заголовок = Заголовок;
			ДокументРезультат.Присоединить(Область);    
						
			ТаблицаИтогов.Колонки.Добавить("Среднее" + Квартал);
			ТаблицаИтогов.Колонки.Добавить("Аванс" + Квартал);  
			СтрокаСвертки = СтрокаСвертки + "Среднее" + Квартал + ",";
			СтрокаСвертки = СтрокаСвертки + "Аванс" + Квартал + ",";        
			
		ИначеЕсли МесяцДаты = 12 Тогда     			
			
			Квартал = СокрЛП((МесяцДаты/3));    	
			Заголовок = "Среднегодовая стоимость недвижимого имущества за " + Квартал + " кв."; 
			Область.Параметры.Заголовок = Заголовок;
			ДокументРезультат.Присоединить(Область);    
			
			Заголовок = "Налог к оплате за " + Квартал + " кв."; 
			Область.Параметры.Заголовок = Заголовок;
			ДокументРезультат.Присоединить(Область);    
			
			ТаблицаИтогов.Колонки.Добавить("Среднее" + Квартал);
			ТаблицаИтогов.Колонки.Добавить("Аванс" + Квартал);  
			СтрокаСвертки = СтрокаСвертки + "Среднее" + Квартал + ",";
			СтрокаСвертки = СтрокаСвертки + "Аванс" + Квартал + ",";     
			
			Заголовок = "Налог за год"; 
			Область.Параметры.Заголовок = Заголовок;
			ДокументРезультат.Присоединить(Область);    			
			
			ТаблицаИтогов.Колонки.Добавить("Год");
			СтрокаСвертки = СтрокаСвертки + "Год,";
		КонецЕсли;		
	КонецЦикла;	       
	
	СтрокаСвертки = Лев(СтрокаСвертки, СтрДлина(СтрокаСвертки) - 1); 
		
	Для Каждого СтрокаДанные Из ОбъектыСреднегодоваяСтоимость Цикл     
		
		СтрокаИтогов = ТаблицаИтогов.Добавить();  
		СтрокаИтогов.ОбъектНедвижимости = СтрокаДанные.ОбъектНедвижимости;
		СтрокаИтогов.СтавкаНалога = СтрокаДанные.СтавкаНалога;
		
		Область = Макет.ПолучитьОбласть("Строка|Объект"); 
		Область.Параметры.ОбъектНедвижимости = СтрокаДанные.ОбъектНедвижимости;  
		Область.Параметры.ОбъектНедвижимостиТекст = СтрокаДанные.ОбъектНедвижимости.Наименование + ", кадастровый номер: " + СтрокаДанные.ОбъектНедвижимости.КадастровыйНомер ;
		ДокументРезультат.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Строка|Показатель"); 

		Среднее = 0;  
		АвансыИтого = 0;
		
		СтоимостиОбъекта = ТаблицаСтоимостей.НайтиСтроки(Новый Структура("ОбъектНедвижимости", СтрокаДанные.ОбъектНедвижимости));
		Для Каждого СтрокаСтоимости ИЗ СтоимостиОбъекта Цикл     
						
			Область.Параметры.ЗначениеПоказателя = СтрокаСтоимости.Стоимость; 
			Среднее = Среднее + СтрокаСтоимости.Стоимость; 
			ДокументРезультат.Присоединить(Область);   
			
   			МесяцДаты = Месяц(СтрокаСтоимости.ДатаОценки);   
			Если МесяцДаты = 12 И Год(СтрокаСтоимости.ДатаОценки) < Год(ЭтотОбъект.Период.ДатаОкончания) Тогда
				МесяцДаты = 0;
			КонецЕсли;				
			
			СтрокаИтогов["Месяц" + МесяцДаты] = СтрокаСтоимости.Стоимость;
			
			Если МесяцДаты = 3 ИЛИ МесяцДаты = 6 ИЛИ МесяцДаты = 9 Тогда     
				
				Квартал = СокрЛП((МесяцДаты/3));
				
				СредняяСтоимость = Окр(Среднее /(МесяцДаты + 1), 2); 

				Аванс = Окр(СредняяСтоимость * СтрокаДанные.СтавкаНалога/100/4, 2);     
				АвансыИтого = АвансыИтого + Аванс; 
				
				Область.Параметры.ЗначениеПоказателя = СредняяСтоимость;
				ДокументРезультат.Присоединить(Область);     
				
				Область.Параметры.ЗначениеПоказателя = Аванс;
				ДокументРезультат.Присоединить(Область);     
				
				СтрокаИтогов["Среднее" + Квартал] = СредняяСтоимость;
				СтрокаИтогов["Аванс" + Квартал] = Аванс;         
				
			ИначеЕсли МесяцДаты = 12 Тогда 
				
				Квартал = СокрЛП((МесяцДаты/3));
				
				СредняяСтоимость = Окр(Среднее /(МесяцДаты + 1), 2); 
				
				НалогГод = Окр(СредняяСтоимость * СтрокаДанные.СтавкаНалога/100, 2);
				НалогКОплате = НалогГод - АвансыИтого;  
				 	
				Область.Параметры.ЗначениеПоказателя = СредняяСтоимость;
				ДокументРезультат.Присоединить(Область);     
				
				Область.Параметры.ЗначениеПоказателя = НалогКОплате;
				ДокументРезультат.Присоединить(Область);     
				
				СтрокаИтогов["Среднее" + Квартал] = СредняяСтоимость;
				СтрокаИтогов["Аванс" + Квартал] = НалогКОплате;
				
				Область.Параметры.ЗначениеПоказателя = НалогГод;
				ДокументРезультат.Присоединить(Область);   
				
				СтрокаИтогов["Год"] = НалогГод;

			КонецЕсли
		КонецЦикла;	
	КонецЦикла;	      
	
	// итог
	ТаблицаИтогов.Свернуть("СтавкаНалога", СтрокаСвертки);
	МассивКолонок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаСвертки);
	
	Область = Макет.ПолучитьОбласть("Итог|Объект"); 
	ДокументРезультат.Вывести(Область); 
	
	АвансыИтого = 0;
	Для Каждого СтрокаИтог Из ТаблицаИтогов Цикл 		
		Область = Макет.ПолучитьОбласть("Итог|Показатель");
		Для Каждого Колонка Из МассивКолонок Цикл
			// авансы пересчитаем по итогу
			Если СтрНачинаетсяС(Колонка, "Аванс") Тогда   
				Квартал = Прав(Колонка, 1); 
				ПредыдущаяКолонка = "Среднее" + Квартал;   
				Если Квартал <> "4" Тогда 
					Аванс = Окр(Окр(СтрокаИтог[ПредыдущаяКолонка], 0) * СтрокаИтог.СтавкаНалога /100/4, 0);  
					АвансыИтого = АвансыИтого + Аванс;
				Иначе    
					Аванс = Окр(Окр(СтрокаИтог[ПредыдущаяКолонка], 0) * СтрокаИтог.СтавкаНалога /100, 0) - АвансыИтого;  
				КонецЕсли;
				Область.Параметры.ЗначениеПоказателя = Аванс;
				ДокументРезультат.Присоединить(Область);	
			ИначеЕсли СтрНачинаетсяС(Колонка, "Год") Тогда   
				ПредыдущаяКолонка = "Среднее4";
				НалогГод = Окр(Окр(СтрокаИтог[ПредыдущаяКолонка], 0) * СтрокаИтог.СтавкаНалога /100, 0);
				Область.Параметры.ЗначениеПоказателя = НалогГод;
				ДокументРезультат.Присоединить(Область);			
			Иначе	
				Область.Параметры.ЗначениеПоказателя = Окр(СтрокаИтог[Колонка], 0);
				ДокументРезультат.Присоединить(Область);			
			КонецЕсли;	
		КонецЦикла;   
	КонецЦикла;   

КонецПроцедуры  

Процедура ПечатьРасшифровкиКадастроваяСтоимость(ДокументРезультат, Макет, ОбъектыКадастроваяСтоимость, ПериодыРасчетаПоКадастру)
	
	Область = Макет.ПолучитьОбласть("Раздел");
	Область.Параметры.Раздел = "Расшифровка расчета налога по объектам, облагаемым налогом по кадастровой стоимости.";
	ДокументРезультат.Вывести(Область);     
	
	МесяцОтчета = Месяц(ЭтотОбъект.Период.ДатаОкончания);
	Квартал = Цел(МесяцОтчета/3); 

	ТаблицаИтогов = Новый ТаблицаЗначений;
	ТаблицаИтогов.Колонки.Добавить("ОбъектНедвижимости");   
	СтрокаСвертки = "";
		
	//шапка 
	Область = Макет.ПолучитьОбласть("ШапкаКадастроваяСтоимость|СекцияКадастроваяСтоимость");
	ДокументРезультат.Вывести(Область);  
	
	Для НомерКвартала = 1 по  Квартал Цикл        
		Область = Макет.ПолучитьОбласть("ШапкаКадастроваяСтоимость|Квартал");
		Область.Параметры.Квартал = НомерКвартала; 
		ДокументРезультат.Присоединить(Область);  
		
		ТаблицаИтогов.Колонки.Добавить("Квартал" + НомерКвартала);
		СтрокаСвертки = СтрокаСвертки + "Квартал" + НомерКвартала + ",";
		
	КонецЦикла;
	
	Если Квартал = 4 Тогда
		Область = Макет.ПолучитьОбласть("ШапкаКадастроваяСтоимость|Год");
		ДокументРезультат.Присоединить(Область);
		
		ТаблицаИтогов.Колонки.Добавить("Год");
		СтрокаСвертки = СтрокаСвертки + "Год,";
		
	КонецЕсли;
	
	СтрокаСвертки = Лев(СтрокаСвертки, СтрДлина(СтрокаСвертки) - 1);
	
	Для Каждого СтрокаДанные Из ОбъектыКадастроваяСтоимость Цикл   
		
		СтрокаИтогов = ТаблицаИтогов.Добавить();  
		СтрокаИтогов.ОбъектНедвижимости = СтрокаДанные.ОбъектНедвижимости;
		
		
		СтрокаПериоды = ПериодыРасчетаПоКадастру.Найти(СтрокаДанные.ОбъектНедвижимости, "ОбъектНедвижимости");
		
		Область = Макет.ПолучитьОбласть("СтрокаКадастроваяСтоимость|СекцияКадастроваяСтоимость");
		ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаДанные);
		ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаПериоды); 
		Если ЗначениеЗаполнено(СтрокаПериоды.Льгота) Тогда
			Область.Параметры.Льгота = Формат(СтрокаПериоды.Льгота, "ЧДЦ=2") + "%";
			Область.Параметры.ПериодЛьготы = Формат(СтрокаПериоды.НачалоПериодаЛьготы, "ДФ=dd.MM.yyyy") + " - " + Формат(СтрокаПериоды.ОкончаниеПериодаЛьготы, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		Область.Параметры.ОбъектНедвижимости = СтрокаДанные.ОбъектНедвижимости;  
		Область.Параметры.ОбъектНедвижимостиТекст = СтрокаДанные.ОбъектНедвижимости.Наименование + ", кадастровый номер: " + СтрокаДанные.ОбъектНедвижимости.КадастровыйНомер ;
		ДокументРезультат.Вывести(Область);  
		
		НалогИтого = 0;
		Область = Макет.ПолучитьОбласть("СтрокаКадастроваяСтоимость|Квартал");
		Для НомерКвартала = 1 по Квартал Цикл
			Если НомерКвартала < 4 Тогда
				Налог = РасчетНалогаПоКадастру(НомерКвартала, СтрокаПериоды);
				НалогИтого = НалогИтого + Налог;
				Область.Параметры.СуммаНалога = Налог;
				ДокументРезультат.Присоединить(Область);
			Иначе
				НалогГод = РасчетНалогаПоКадастру(НомерКвартала, СтрокаПериоды);
				Налог = НалогГод - НалогИтого;
				Область.Параметры.СуммаНалога = Налог;
				ДокументРезультат.Присоединить(Область); 
			КонецЕсли;  
			СтрокаИтогов["Квартал" + НомерКвартала] = Налог;
		КонецЦикла;
		
		Если Квартал = 4 Тогда       
			Область = Макет.ПолучитьОбласть("СтрокаКадастроваяСтоимость|Год");
			Область.Параметры.СуммаНалогаГод = НалогГод;
			ДокументРезультат.Присоединить(Область);   
			СтрокаИтогов["Год"] = НалогГод;
		КонецЕсли;
	КонецЦикла;       
	
	//итог
	ТаблицаИтогов.Свернуть("", СтрокаСвертки);
	МассивКолонок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаСвертки);
	
	Область = Макет.ПолучитьОбласть("ИтогКадастроваяСтоимость|СекцияКадастроваяСтоимость");
	ДокументРезультат.Вывести(Область);
	
	//не только кварталN, но и Год проставляется в этом цикле
	Для Каждого СтрокаИтог Из ТаблицаИтогов Цикл
		Область = Макет.ПолучитьОбласть("ИтогКадастроваяСтоимость|Квартал");  
		Для Каждого Колонка Из МассивКолонок Цикл
			Область.Параметры.СуммаНалогаИтого = СтрокаИтог[Колонка];    
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчет(ДокументРезультат, Подписант) Экспорт
	
	ДокументРезультат.Очистить();
	Отказ = Ложь;
	
	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();	
	
	Попытка
    	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;	
	
	РасчетНалога = РассчитатьНалогНаИмущество(ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Отказ, Истина); 
	Если Отказ Тогда        
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет налога завершился с ошибкой. Расшифовка не будет построена.");
		Возврат;
	КонецЕсли;	
		
	Макет = ПолучитьМакет("Отчет"); 
	
	ПараметрыШапки = ПолучитьПараметрыШапки(ЭтотОбъект.Период.ДатаОкончания, Организация, СчетДоверительногоУправления);	
	
	//заголовок 
	Область = Макет.ПолучитьОбласть("Заголовок");     
	Область.Параметры.ДоверительныйУправляющий = ПараметрыШапки.ДоверительныйУправляющий;
	Область.Параметры.УчредительУправления = ПараметрыШапки.УчредительУправления;
	
	Область.Параметры.ПериодОтчета = КонсолидированнаяОтчетность.ПредставлениеФинансовогоПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);   
	ДокументРезультат.Вывести(Область);
	
	//Среднегодовая Стоимость     
	ОбъектыСреднегодоваяСтоимость = РасчетНалога.ТаблицаДанные.НайтиСтроки(Новый Структура("РасчетПоКадастровойСтоимости", Ложь));
	Если ОбъектыСреднегодоваяСтоимость.Количество() > 0 Тогда 
		ПечатьРасшифровкиСреднегодоваяСтоимость(ДокументРезультат, Макет, ОбъектыСреднегодоваяСтоимость, РасчетНалога.СписокДатОценки, РасчетНалога.ТаблицаСтоимостей);
	КонецЕсли;
	
	ОбъектыКадастроваяСтоимость = РасчетНалога.ТаблицаДанные.НайтиСтроки(Новый Структура("РасчетПоКадастровойСтоимости", Истина));
	Если ОбъектыКадастроваяСтоимость.Количество() > 0 Тогда 
		ПечатьРасшифровкиКадастроваяСтоимость(ДокументРезультат, Макет, ОбъектыКадастроваяСтоимость, РасчетНалога.ПериодыРасчетаПоКадастру);
	КонецЕсли;
	
	
	//подписант 
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(Подписант, ЭтотОбъект.Организация);
		
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
		
КонецПроцедуры
